{
  "empresa": "istqb",
  "titulo": "ISTQB® Certified Tester Syllabus Foundation Level v4.0 Exam D",
  "descripcion": "Banco de preguntas ISTQB® CTFL v4.0 – Examen de práctica (Set D, v1.6). 40 preguntas de opción múltiple extraídas de las páginas 6–21;",
  "minimo_aprobacion": 26,
  "retroalimentacion": [
    { "umbral": 90, "mensaje": "¡Excelente! Nivel muy alto de preparación." },
    { "umbral": 75, "mensaje": "Muy bien, estás en camino de aprobar." },
    {
      "umbral": 65,
      "mensaje": "Suficiente para aprobar, pero puedes mejorar."
    },
    { "umbral": 0, "mensaje": "Recomendamos seguir estudiando." }
  ],
  "examen": [
  {
    "numero": 1,
    "pregunta": "Which of the following is a typical test objective?",
    "opciones": [
      "a) Finding and fixing defects in the test object",
      "b) Maintaining effective communications with developers",
      "c) Validating that legal requirements have been met",
      "d) Building confidence in the quality of the test object"
    ],
    "respuesta_correcta": 3,
    "numero_respuestas": "ONE",
    "explicacion": "Un objetivo típico de las pruebas es aumentar la confianza en la calidad del producto al reducir riesgos mediante la detección de defectos. Las pruebas no se encargan de arreglarlos (eso es depuración).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 2,
    "pregunta": "A designer documents a design for a user interface that does not suitably address disabled users because the designer is tired. The programmer implements the user interface in line with the design but as they are working under severe time pressure, they do not include suitable exception handling in their program code for bonus calculations. When the operational system is used, complaints are made by some disabled users about the interface and the company is subsequently fined by the relevant regulatory authority. No one notices that bonus calculations are sometimes incorrect.\n\nWhich of the following statements is CORRECT?",
    "opciones": [
      "a) The miscalculation of bonuses is a defect that occasionally occurs",
      "b) The fine received for failing to address some disabled users is a failure",
      "c) The programmer working under severe time pressure is a root cause",
      "d) The design of the user interface includes a designer error"
    ],
    "respuesta_correcta": 3,
    "numero_respuestas": "ONE",
    "explicacion": "Un error de diseñador (mistake) en el diseño de UI genera un defecto de especificación. La multa es una consecuencia de negocio, y la mala”cálculo en ejecución” es un fallo (failure), no el defecto en sí. La presión de tiempo es un factor causal, pero el enunciado identifica explícitamente un error del diseñador.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 3,
    "pregunta": "Test conditions are being used by testers to generate test cases and execute tests. Even though the test conditions remain the same, the test cases are varied each time. Which of the following ‘principles of testing’ is being addressed through the variation of test cases?",
    "opciones": [
      "a) Tests wear out",
      "b) Absence-of-defects fallacy",
      "c) Early testing saves time and money",
      "d) Defects cluster together"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "El principio “los tests se desgastan” indica que repetir exactamente los mismos casos pierde efectividad; variarlos incrementa la probabilidad de encontrar nuevos defectos.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 4,
    "pregunta": "Given the following test tasks:\n\n1. Derive test cases from test conditions\n2. Identify reusable testware\n3. Organize test cases into test procedures\n4. Evaluate the test basis and the test object\n\nAnd the following test activities:\nA. Test analysis\nB. Test design\nC. Test implementation\nD. Test completion\n\nWhich of the following BEST matches the tasks with the activities?",
    "opciones": [
      "a) 1B, 2A, 3D, 4C",
      "b) 1B, 2D, 3C, 4A",
      "c) 1C, 2A, 3B, 4D",
      "d) 1C, 2D, 3A, 4B"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "1→B (diseño deriva casos), 2→D (en cierre se identifica testware reutilizable), 3→C (implementación organiza en procedimientos), 4→A (análisis evalúa la base y el objeto de prueba).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 5,
    "pregunta": "Given the following testware:\n\ni. Test completion report\nii. Data held in a database used for test inputs and expected results\niii. The list of elements needed to build the test environment\niv. Documented sequences of test cases in execution order\nv. Test cases\n\nWhich of the following BEST shows the testware produced as a result of performing test implementation?",
    "opciones": [
      "a) ii, iv",
      "b) iii, v",
      "c) i, ii, v",
      "d) i, iii, iv"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "La implementación concreta datos de prueba y define procedimientos (secuencias de ejecución): ii y iv.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 6,
    "pregunta": "Which of the following is MOST likely to describe a task performed by someone in a test management role?",
    "opciones": [
      "a) Evaluate the test basis and the test object",
      "b) Define test environment requirements",
      "c) Assess testability of the test object",
      "d) Create the test completion report"
    ],
    "respuesta_correcta": 3,
    "numero_respuestas": "ONE",
    "explicacion": "El informe de cierre (test completion report) es típicamente responsabilidad de la gestión de pruebas.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 7,
    "pregunta": "Which of the following is an advantage of the whole team approach?",
    "opciones": [
      "a) Improved communication between team members",
      "b) Decreased individual accountability for quality",
      "c) Faster deployment of deliverables to the end users",
      "d) Reduced collaboration with external business users"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "El enfoque de equipo completo mejora la comunicación y colaboración entre los miembros del equipo.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 8,
    "pregunta": "Given the following benefits and drawbacks of the independence of testing:\n\ni. The testers work in a different location from the developers\nii. Testers question the assumptions programmers make while writing code\niii. A confrontational dynamic has been established between testers and developers\niv. Developers have convinced themselves that testers are mostly accountable for quality\nv. Testers have different biases than those held by the developers\n\nWhich are MOST likely to be considered benefits?",
    "opciones": [
      "a) i, iv",
      "b) ii, v",
      "c) i, iii, iv",
      "d) ii, iii, v"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "Cuestionar supuestos (ii) y aportar sesgos distintos (v) son beneficios típicos de la independencia. Los otros elementos son inconvenientes.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 9,
    "pregunta": "Which of the following is a good testing practice that applies to all software development lifecycles?",
    "opciones": [
      "a) Each test level has specific and distinct test objectives",
      "b) Test implementation and execution for a given test level should start during the corresponding development phase",
      "c) Testers should start test design as soon as drafts of the relevant work products become available",
      "d) Every dynamic testing activity has a corresponding static testing activity"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "Revisar y diseñar pruebas tan pronto haya borradores reduce costos y previene defectos (shift-left).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 10,
    "pregunta": "Which of the following is an example of a test-first approach to development?",
    "opciones": [
      "a) Behavior-Driven Development",
      "b) Test Level Driven Development",
      "c) Function-Driven Development",
      "d) Performance-Driven Development"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "BDD es un enfoque test-first (criterios de aceptación/escenarios guían el desarrollo).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 11,
    "pregunta": "Which of the following is MOST likely to be a challenge encountered when implementing DevOps?",
    "opciones": [
      "a) Making sure that non-functional quality characteristics are not overlooked",
      "b) Managing continuously changing test environments",
      "c) The need for more manual testers with suitable experience",
      "d) Setting up the test automation as part of the delivery pipeline"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "En DevOps los entornos cambian con frecuencia; gestionarlos y mantenerlos consistentes es un reto clave.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 12,
    "pregunta": "Which of the following BEST describes retrospectives?",
    "opciones": [
      "a) Retrospectives allow team members to identify other team members who did not fully contribute to achieving quality as required by the whole team approach",
      "b) Retrospectives give testers an opportunity to identify activities that were successful so that these are retained when potential improvements are made in the future",
      "c) Retrospectives are where agile team members are allowed to voice their concerns about management and customers in a blameless environment",
      "d) Retrospectives give agile team members a forum where they focus on discussing the plan and technical decisions for the next iteration"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "El objetivo es aprender: qué funcionó y qué mejorar, para conservar prácticas efectivas en el futuro.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 13,
    "pregunta": "Which of the following tests is MOST likely to be performed as part of functional testing?",
    "opciones": [
      "a) The test checks that the sort function puts the elements of the list or array in ascending order",
      "b) The test checks whether the sort function completes sorting within one second of starting",
      "c) The test checks how easily the sort function can be changed from sorting ascending to sorting descending",
      "d) The test checks that the sort function still functions correctly when moved from a 32-bit to a 64-bit architecture"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "Verificar el resultado funcional (lista ordenada) es prueba funcional; las otras son no funcionales o de portabilidad/mantenibilidad.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 14,
    "pregunta": "Which of the following is MOST likely to be a trigger that leads to maintenance testing of a currency exchange system?",
    "opciones": [
      "a) The developers reported that changing the currency exchange system was difficult and the testers decided to check if this was true",
      "b) The refund option of the currency exchange system was removed as it did not always repay the correct amount to customers",
      "c) The agile team has started developing a user story that adds a new customer loyalty feature to the currency exchange system",
      "d) The language support option of the currency exchange system was used to enable both English and local language currency transactions"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "Agregar una nueva funcionalidad (cambio) dispara pruebas de mantenimiento (p. ej., regresión y pruebas del cambio).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 15,
    "pregunta": "Which of the following CANNOT be examined by static testing?",
    "opciones": [
      "a) Contract",
      "b) Test plan",
      "c) Encrypted code",
      "d) Test charter"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "El código cifrado no es analizable útilmente por técnicas estáticas; los demás son artefactos revisables.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 16,
    "pregunta": "Which of the following statements about the value of static testing is CORRECT?",
    "opciones": [
      "a) The defect types found by static testing are different from the defect types that can be found by dynamic testing",
      "b) Dynamic testing can detect the defect types that can be found by static testing plus some additional defect types",
      "c) Dynamic testing can identify some of the defects that can be found by static testing but not all of them",
      "d) Static testing can identify the defect types that can be found by dynamic testing as well as some extra defect types"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "La estática y la dinámica encuentran tipos de defectos distintos y complementarios (p. ej., estándares/consistencia vs. fallos en ejecución).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 17,
    "pregunta": "Given the following descriptions of review activities:\n\n1. Detected anomalies are deliberated upon, and determinations are reached regarding their status, ownership, and any further steps needed\n2. Defects are recorded, and any needed updates are addressed prior to the acceptance of the work product\n3. Reviewers employ techniques to come up with suggestions and questions about the work product and to spot anomalies\n4. The objective of the review and its schedule are established to ensure a focused and efficient review\n5. Participants are provided with access to the item being reviewed\n\nWhich of the following is the CORRECT sequence in the review process of the activities that correspond to the descriptions?",
    "opciones": [
      "a) 4 – 3 – 5 – 2 – 1",
      "b) 4 – 5 – 3 – 1 – 2",
      "c) 5 – 4 – 1 – 3 – 2",
      "d) 5 – 4 – 3 – 2 – 1"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "Orden típico: planificación del objetivo y agenda (4) → iniciar y dar acceso al artefacto (5) → preparación individual (3) → reunión/análisis y acuerdos (1) → retrabajo y seguimiento (2).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 18,
    "pregunta": "Which participant in the review process is responsible for ensuring that the review meetings run effectively and that everyone at the meetings can voice their opinions freely?",
    "opciones": [
      "a) Manager",
      "b) Moderator",
      "c) Chairperson",
      "d) Review Leader"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "El moderador/facilitador asegura la eficacia de la reunión y un ambiente seguro para opinar.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 19,
    "pregunta": "You perform system testing of an e-commerce web application and are provided with the following requirement:\n\nREQ 05-017. If the total cost of purchases exceeds $100, the customer gets a 5% discount on subsequent purchases. Otherwise, the customer does not receive a discount.\n\nWhich test techniques will be MOST helpful in designing test cases based on this requirement?",
    "opciones": [
      "a) White-box test techniques",
      "b) Black-box test techniques",
      "c) Experience-based test techniques",
      "d) Risk-based test techniques"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "El requisito se prueba mejor con técnicas de caja negra (p. ej., particiones/valores límite respecto a $100).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 20,
    "pregunta": "The system for selling cinema tickets calculates the discount type based on the client’s birth year (BY) and on the current year (CY) as follows:\n\nLet D be the difference between CY and BY, that is, D = CY – BY\n\n• If D < 0 then print the error message “birth year cannot be greater than current year”\n• If 0 ≤ D < 18 then apply the student discount\n• If 18 ≤ D < 65 then apply no discount\n• If D ≥ 65 then apply the pensioner discount\n\nYour test suite already contains two test cases:\n• BY = 1990, CY = 2020, expected result: no discount\n• BY = 2030, CY = 2029, expected result: print the error message\n\nWhich of the following test data sets should be added to achieve full valid equivalence partitioning coverage for the discount type?",
    "opciones": [
      "a) BY = 2001, CY = 2065",
      "b) BY = 1900, CY = 1965",
      "c) BY = 1965, CY = 1900",
      "d) BY = 2011, CY = 2029",
      "e) BY = 2000, CY = 2000"
    ],
    "respuesta_correcta": [1, 4],
    "numero_respuestas": "TWO",
    "explicacion": "Faltan particiones válidas de ‘estudiante’ (D∈[0,18)) y ‘pensionista’ (D≥65). e) da D=0 (estudiante) y b) da D=65 (pensionista).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 21,
    "pregunta": "You are testing a temperature control system for a horticultural cold storage facility. The system receives the temperature (in full degrees Celsius) as the input. If the temperature is between 0 and 2 degrees inclusive, the system displays the message “temperature OK”. For lower temperatures, the system displays the message 'temperature too low' and for higher temperatures it displays the message 'temperature too high'.\n\nUsing two-value boundary value analysis, which of the following sets of test inputs provides the highest level of boundary value coverage?",
    "opciones": [
      "a) -1, 3",
      "b) 0, 2",
      "c) -1, 0, 2, 3",
      "d) -2, 0, 2, 4"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "Se prueban ambos límites con su adyacente: (-1,0) y (2,3), cubriendo las transiciones a ‘OK’ y fuera de rango.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 22,
    "pregunta": "You are designing test cases based on the following decision table.\n\n R1 R2 R3 R4 R5 R6 R7\n\nC1: Age 0-18 19-65 19-65 >65 0-18 19-65 >65\n\nC2: Experience - 0-4 >4 - - - -\n\nC3: Registered? NO NO NO NO YES YES YES\n\nCategory A A B B B D C\n\nSo far you have designed the following test cases:\n• TC1: 19-year-old, unregistered man with no experience; expected result: category A\n• TC2: 65-year-old, unregistered woman with 5 years of experience; expected result: category B\n• TC3: 66-year-old, registered man with no experience; expected result: category C\n• TC4: 65-year-old, registered woman with 4 years of experience; expected result: category D\n\nWhich of the following test cases, when added to the existing set of test cases, will increase the decision table coverage?",
    "opciones": [
      "a) 66-year-old, unregistered man with no experience; expected result: category B",
      "b) 55-year-old, unregistered woman with 2 years of experience; expected result: category A",
      "c) 19-year-old, registered woman with 5 years of experience; expected result: category D",
      "d) No additional test case can increase the already achieved decision table coverage"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "Las reglas cubiertas son R2, R3, R6 y R7. El caso (a) cubre R4 (>65, NO registrado) que falta; (b) repite R2 y (c) repite R6.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 23,
    "pregunta": "You are applying state transition testing to the hotel room reservation system modeled by the following state transition table, with 4 states and 5 different events:\n\nEvents\n\nState Available NotAvailable ChangeRoom Cancel Pay\n\nS1: Requesting S2 S3\nS2: Confirmed S1 S4 S4\nS3: Waiting list S2 S4\nS4: End\n\nAssuming all test cases start in the ‘Requesting’ state, which of the following test cases, represented as sequences of events, achieves the highest valid transitions coverage?",
    "opciones": [
      "a) NotAvailable, Available, ChangeRoom, NotAvailable, Cancel",
      "b) Available, ChangeRoom, NotAvailable, Available, Pay",
      "c) Available, ChangeRoom, Available, ChangeRoom, NotAvailable",
      "d) NotAvailable, Cancel, ChangeRoom, Available, Pay"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "La secuencia (a) cubre S1→S3 (NotAvailable), S3→S2 (Available) y S2→S4 (ChangeRoom) antes de finalizar, maximizando transiciones válidas.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 24,
    "pregunta": "Your test suite S for a program P achieves 100% statement coverage. It consists of three test cases, each of which achieves 50% statement coverage.\n\nWhich of the following statements is CORRECT?",
    "opciones": [
      "a) Executing S will cause all possible failures in P",
      "b) S achieves 100% branch coverage for P",
      "c) Every executable statement in P containing a defect has been run at least once during the execution of S",
      "d) After removing one test case from S, the remaining two test cases will still achieve 100% statement coverage"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "100% de cobertura de sentencias implica que todas las instrucciones ejecutables se han ejecutado al menos una vez (aunque no garantiza revelar todos los fallos).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 25,
    "pregunta": "Why does white-box testing facilitate defect detection even when the software specification is vague, outdated or incomplete?",
    "opciones": [
      "a) Test cases are designed based on the structure of the test object rather than the specification",
      "b) For each white-box test technique the coverage can be well-defined and easily measured",
      "c) White-box test techniques are very well designed to detect omissions in the requirements",
      "d) White-box test techniques can be used in both static testing and dynamic testing"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "Las pruebas de caja blanca se basan en la estructura del código; no dependen de una especificación precisa para diseñar casos eficaces.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 26,
    "pregunta": "Which of the following is NOT anticipated by the tester while applying error guessing?",
    "opciones": [
      "a) The developer misunderstood the formula in the user story for calculating the interest",
      "b) The developer wrote “FA = A*(1+IR^N)” instead of “FA = A*(1+IR)^N” in the source code",
      "c) The developer missed the seminar on new compound interest rate legislation",
      "d) The accuracy of the interest calculated by the system is not precise enough"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "‘Error guessing’ se centra en errores típicos de requisitos/código o uso; no en asistir o no a un seminario (c), que es un factor externo de formación.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 27,
    "pregunta": "Which of the following is true about exploratory testing?",
    "opciones": [
      "a) Test cases are designed before the exploratory testing session starts",
      "b) The tester can perform test execution, but cannot perform test design",
      "c) Exploratory testing results are good predictors of the number of remaining defects",
      "d) During exploratory testing the tester may use black-box test techniques"
    ],
    "respuesta_correcta": 3,
    "numero_respuestas": "ONE",
    "explicacion": "En exploratoria el tester diseña y ejecuta en sesión, apoyándose en técnicas de caja negra cuando conviene.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 28,
    "pregunta": "Which collaborative user story writing practice enables the team to achieve a collective understanding of what needs to be delivered?",
    "opciones": [
      "a) Planning poker, so that a team can achieve consensus on the effort needed to implement a user story",
      "b) Reviews, so that a team can detect inconsistencies and contradictions in a user story",
      "c) Iteration planning, so that user stories with the highest business value for a customer can be prioritized for implementation",
      "d) Conversation, so that team members can understand how the software will be used"
    ],
    "respuesta_correcta": 3,
    "numero_respuestas": "ONE",
    "explicacion": "La ‘conversación’ (3C: Card, Conversation, Confirmation) alinea a todo el equipo en el entendimiento compartido de la historia.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 29,
    "pregunta": "You have just started designing test cases for the following user story.\n\nAs a customer,\nI want to be able to filter search results by price range, so that I can find products within my budget more easily.\nAcceptance criteria:\n1. The filter should work for all versions of the application from version 3.0 upwards\n2. The filter should allow the customer to set a price range with a minimum and a maximum price\n3. The search results should update dynamically as the customer adjusts the price range filter\n\nIn all test cases the precondition is as follows: there are only two products available, products A and B. Product A costs $100 and product B costs $110.\n\nWhich of the following is the BEST example of a test case for this user story?",
    "opciones": [
      "a) Enter webpage and set filter to show prices between $90 and $100. Expected result: results show product A only. Set maximum price to $110. Expected result: results now include both products A and B",
      "b) Enter webpage. Expected result: the default minimum and maximum prices are $100 and $110 respectively. Add product C to stock, with price $120. Refresh the client’s webpage. Expected result: the default maximum price changes to $120",
      "c) Enter webpage and set filter to show prices between $90 and $115. Expected result: results show both products A and B. Change currency from USD to EUR. Expected result: the filter range changes correctly to EUR values, according to the current exchange rate",
      "d) Enter webpage with three different browsers: Edge, Chrome and Opera. In each browser set filter between $90 and $110. Expected result: results include both products A and B and the results layout is the same in all three browsers"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "La opción (a) valida rango mínimo/máximo y actualización dinámica de resultados, respetando la precondición dada.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 30,
    "pregunta": "Which of the following BEST define EXIT criteria in a testing project?",
    "opciones": [
      "a) Budget is approved",
      "b) Budget runs out",
      "c) Test basis is available",
      "d) Test cases achieved at least 80% statement coverage",
      "e) All test analysts are ISTQB certified at the Foundation Level"
    ],
    "respuesta_correcta": [1, 3],
    "numero_respuestas": "TWO",
    "explicacion": "Como criterio formal de salida se pueden fijar umbrales de cobertura (p. ej., ≥80%). En la práctica, el agotamiento de presupuesto también puede forzar la salida, aunque no sea lo ideal. Los otros son criterios de entrada o de recursos.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 31,
    "pregunta": "The team wants to estimate the time needed for one tester to execute four test cases for a software component. The team has gathered the following measures of the effort used to execute a single test case:\n\n• Best-case scenario: 1 hour\n• Worst-case scenario: 8 hours\n• Most likely scenario: 3 hours\n\nGiven that the three-point estimation technique is being used, what is the final estimate of the time needed to execute all four test cases?",
    "opciones": [
      "a) 14 hours",
      "b) 3.5 hours",
      "c) 16 hours",
      "d) 12 hours"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "PERT por caso: (1 + 4×3 + 8)/6 = 3.5 h. Para 4 casos: 3.5×4 = 14 horas.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 32,
    "pregunta": "The table shows the traceability matrix from test cases to requirements. “X” means that a given test case covers the corresponding requirement.\n\n Req1 Req2 Req3 Req4 Req5 Req6 Req7\n\nTC1 X X X X\nTC2 X X X\nTC3 X X\nTC4 X\n\nYou want to prioritize the test cases following the additional coverage prioritization technique.\n\nYou execute all four test cases.\n\nWhich test case should be executed as the LAST one?",
    "opciones": [
      "a) TC1",
      "b) TC2",
      "c) TC3",
      "d) TC4"
    ],
    "respuesta_correcta": 3,
    "numero_respuestas": "ONE",
    "explicacion": "Con ‘additional coverage’, tras ejecutar TC1 (cubre más requisitos), los que aportan menos nuevos ítems se dejan para el final; TC4 añade menos cobertura y debe ir último.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 33,
    "pregunta": "How can the testing quadrants be beneficial for testing?",
    "opciones": [
      "a) They help in test planning by dividing the test process into four phases, corresponding to the four basic test levels: component, integration, system, and acceptance testing",
      "b) They help in assessing the high-level coverage (e.g., requirements coverage) based on low-level coverage (e.g., code coverage)",
      "c) They help non-technical stakeholders to understand the different test types and that some test types are more relevant to certain test levels than others",
      "d) They help agile teams to develop a communication strategy based on classifying people according to four basic psychological types, and on modelling the relations between them"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "Los cuadrantes ayudan a explicar tipos de prueba y su propósito (negocio/tecnología; soporte/critican el producto) a todos los interesados.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 34,
    "pregunta": "For a given risk, its risk level is $1,000 and its risk likelihood is estimated as 50%.\n\nWhat is the risk impact?",
    "opciones": [
      "a) $500",
      "b) $2,000",
      "c) $50,000",
      "d) $200"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "Nivel de riesgo = Probabilidad × Impacto. Por tanto, Impacto = 1000 / 0.5 = $2,000.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 35,
    "pregunta": "Which of the following are product risks?",
    "opciones": [
      "a) Scope creep",
      "b) Poor architecture",
      "c) Cost-cutting",
      "d) Poor tool support",
      "e) Too long response time"
    ],
    "respuesta_correcta": [1, 4],
    "numero_respuestas": "TWO",
    "explicacion": "Riesgos del producto: mala arquitectura y tiempos de respuesta largos (calidad del sistema). Los otros son riesgos de proyecto/proceso.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 36,
    "pregunta": "Which of the following is NOT a valid purpose for a test report?",
    "opciones": [
      "a) Tracking test progress and identifying areas that require further attention",
      "b) Providing information on the tests executed, their results, and defects found",
      "c) Providing information about each defect, such as the steps to reproduce it",
      "d) Providing information on testing planned for the next period"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "Los detalles por defecto (pasos para reproducir) pertenecen a informes de defectos, no al informe de pruebas.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 37,
    "pregunta": "The user reported a software failure. An engineer from the support team asked the user for the software version number where the failure was observed. Based on the version number, the team reassembled all the files that made up the release. This later allowed a developer to perform analysis, find the defect, and fix it.\n\nWhich of the following enabled the above activity to be performed by the team?",
    "opciones": [
      "a) Risk management",
      "b) Test monitoring and control",
      "c) Whole team approach",
      "d) Configuration management"
    ],
    "respuesta_correcta": 3,
    "numero_respuestas": "ONE",
    "explicacion": "La gestión de la configuración permite identificar y reconstruir exactamente la versión liberada (archivos/componentes).",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 38,
    "pregunta": "Consider the following defect report for a Book Lending System.\n\nDefect ID: 001 | Title: Unable to Return a Book |\nSeverity: High | Priority: |\nEnvironment: Windows 10, Google Chrome\n\nDescription: When attempting to return a book using the Book Return feature, the system does not register the return and the book remains checked out to the user.\n\nSteps to Reproduce:\nLogin to the Book Lending System as a user who has checked out a book.\nClick on the 'Book Return' button for the book that has been checked out.\nSystem does not register the return and the book remains checked out.\n\nExpected Result: The book should be returned and no longer appear as checked out to the user.\nActual Result: The book remains checked out to the user and is not registered as returned in the system.\n\nAttachments: [empty list]\n\nWhich of the following is MOST likely to help the developer reproduce the failure quickly?",
    "opciones": [
      "a) Adding information about which users and which books the failure affects to the “Description” section",
      "b) Filling in the missing value for the “Priority” field",
      "c) Adding memory dumps and database snapshots taken after each step described in the “Steps to Reproduce” section to the “Attachments” section.",
      "d) Repeating the same test case for different environments and writing defect reports for each of them separately"
    ],
    "respuesta_correcta": 0,
    "numero_respuestas": "ONE",
    "explicacion": "Datos concretos (usuarios/libros afectados) hacen el problema reproducible de inmediato; prioridad o volcados masivos no aportan tanto aquí.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 39,
    "pregunta": "Given the following test tool categories:\n\ni. Collaboration tools\nii. DevOps tools\niii. Management tools\niv. Non-functional testing tools \nv. Test design and implementation tools\n\nTools from which of the categories are MOST likely to facilitate test execution?",
    "opciones": [
      "a) i, v",
      "b) ii, iv",
      "c) i, iii, v",
      "d) ii, iii, iv"
    ],
    "respuesta_correcta": 1,
    "numero_respuestas": "ONE",
    "explicacion": "Herramientas DevOps (pipelines/CI-CD) y de pruebas no funcionales (drivers/generadores/cargadores) facilitan directamente la ejecución.",
    "imageUrl": "",
    "ytURL": ""
  },
  {
    "numero": 40,
    "pregunta": "Which of the following is MOST likely to be a risk of test automation?",
    "opciones": [
      "a) The detection of additional high-severity defects",
      "b) Providing measures that are too complicated for humans to derive",
      "c) Incompatibility with the development platform",
      "d) Substantially reduced test execution times"
    ],
    "respuesta_correcta": 2,
    "numero_respuestas": "ONE",
    "explicacion": "Un riesgo común es la incompatibilidad de herramientas con la plataforma/tecnología del sistema bajo prueba.",
    "imageUrl": "",
    "ytURL": ""
  }
]

}